# Mac Menu Bar Stats
cask "stats", restart_service: true if OS.mac?

# Dracula
tap "dracula/install"
cask "dracula-terminal"

# VSCode
cask "visual-studio-code"

# Alfred
cask "alfred"

# Slack
cask "slack"

# PocketCasts
cask "pocket-casts"

# Todoist
cask "todoist"

# VSCode Extensions
vscode "dracula-theme.theme-dracula"
vscode "golang.go"
vscode "ms-vscode-remote.remote-ssh"
vscode "shakram02.bash-beautify"

# Golang
brew "go"

# Docker
cask "docker"

# Kubernetes
brew "kubectl"
brew "helm"
brew "k9s"

# CLI Things
brew 'bash-completion'
brew 'k3d'
brew 'git'
brew "jq"
brew "yq"
